---
title: TriangleInShellComponent
classe: Autodesk.Revit.DB.TriangleInShellComponent
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 5
---

# TriangleInShellComponent

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsValidObject { get; }` | `triangleInShellComponent.IsValidObject` | Boolean |
| `Int32 VertexIndex0 { get; }` | `triangleInShellComponent.VertexIndex0` | Int32 |
| `Int32 VertexIndex1 { get; }` | `triangleInShellComponent.VertexIndex1` | Int32 |
| `Int32 VertexIndex2 { get; }` | `triangleInShellComponent.VertexIndex2` | Int32 |
| `Void Dispose()` | `triangleInShellComponent.Dispose()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```